---
title: TextRange
classe: Autodesk.Revit.DB.TextRange
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# TextRange

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 End { get; }` | `textRange.End` | Int32 |
| `Boolean IsValidObject { get; }` | `textRange.IsValidObject` | Boolean |
| `Int32 Length { get; set; }` | `textRange.Length` | Int32 |
| `Int32 Start { get; set; }` | `textRange.Start` | Int32 |
| `Void Dispose()` | `textRange.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```